[
  {
    "id": 1,
    "name": "Hackatron Asia - Unleash the coding machine in you",
    "description": "Hackatron Asia Singapore is a 32-hour weekend of problem solving and hacking solutions to real problems. Brought to you by Asia’s largest online publication on technology and startups, Tech in Asia, Hackatron Asia bridges brands with real challenges and technology offerings to developers with a knack for solving technical problems.",
    "location": "Le Danz, 222 Queen Street, #01-01/02, Singapore, SG",
    "url": "http://hackatron.techinasia.com/",
    "group_name": "Tech in Asia",
    "group_url" : "http://techinasia.com/",
    "formatted_time": "6 Dec, Sat, 9:00 am",
    "start_time": "2014-12-06T01:00:00.000Z",
    "end_time": "2014-12-06T13:00:00.000Z"
  },
  {
    "id": 2,
    "name": "Startup Weekend EDU Singapore",
    "description": "The mission of the event is reinvent education from ground up. It's the learners and educators in the field who gets first hand knowledge of what works and what doesn't. This platform allows educators, students, IT designers, developers and business professionals to all come together, mingle, discuss, strategize and over the next 54 hours, create a sustainable, socially positive business model to help both our young and adult learners. Coupled with the assistance of mentors and judges who can provide valuable industry experiences, the chances for you and your team to succeed is exponentially multiplied. We are encouraging you to take up entrepreneurship as a career, and a career in education is a noble calling. Many of us are not satisfy with what the current education, and we know it can be better. What more a better way to  1. Make a deep positive impact to the community  2. Chart your career the way you want it.  3.  Make a whole load of money in the process. ( at least some ) The event focuses on creating businesses for the education industry - both academic and non academic student related services. Your ideas can range from student well-being, training, internship, career coaching and mentoring, social emotional learning, sports, student management system, better learning concept, brick and mortar solution or web and mobile applications, etc. If you think there's a better way of doing things, come on board. If you think you have a solution to disrupt the tuition industry, we need you!  No one said it is easy, but with everyone in the same tribe, success is just round the corner. We have aligned the stars for you with a group of mentors and judges who are equally passionate about sharing their knowledge and expertise to help you. We need you to spend the next 54 hours with us. ",
    "location": "Singapore Training and Development Association (STADA) 16 Arumugam Road #06-01 Lion Building D Singapore, Singapore 409961",
    "url": "http://www.up.co/communities/singapore/singapore/startup-weekend/3883",
    "group_name": "Startup Weekend",
    "group_url" : "http://www.up.co/communities/singapore/singapore/startup-weekend/3883",
    "formatted_time": "7 Nov, Fri, 6:30pm",
    "start_time": "2014-11-07T10:30:00.000Z",
    "end_time": "2014-11-09T13:00:00.000Z"
  }
]
